Tasks/ЗадачаВнешнееПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ЗадачаВнешнееПроизводство</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОжидаемогоОкончанияПодрядчиком</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаНаСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/ВнешнееПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВнешнееПроизводство</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОжидаемогоОкончанияПодрядчиком</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРеальнойГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоставкаНаСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипВнешнегоПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнегоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистраторДвижения</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаВнешнееПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.НазначениеВнешнегоПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменитьВнешнееПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Tasks/ЗадачаВнешнееПроизводство/Ext/ObjectModule.bsl
Процедура ПриВыполнении(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешнееПроизводствоСрезПоследних.ДатаРеальнойГотовности КАК ДатаРеальнойГотовности,
		|	ВнешнееПроизводствоСрезПоследних.Отмена КАК Отмена,
		|	ВнешнееПроизводствоСрезПоследних.ТипВнешнегоПроизводства КАК ТипВнешнегоПроизводства
		|ИЗ
		|	РегистрСведений.ВнешнееПроизводство.СрезПоследних КАК ВнешнееПроизводствоСрезПоследних
		|ГДЕ
		|	ВнешнееПроизводствоСрезПоследних.Комплект = &Комплект
		|
		|СГРУППИРОВАТЬ ПО
		|	ВнешнееПроизводствоСрезПоследних.Отмена,
		|	ВнешнееПроизводствоСрезПоследних.ТипВнешнегоПроизводства,
		|	ВнешнееПроизводствоСрезПоследних.ДатаРеальнойГотовности";
	
	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МенеджерЗаписи = РегистрыСведений.ВнешнееПроизводство.СоздатьМенеджерЗаписи();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
	КонецЦикла;
	
	МенеджерЗаписи.Период								= ТекущаяДата();
	МенеджерЗаписи.ДатаРеальнойГотовности 				= МенеджерЗаписи.Период;
	МенеджерЗаписи.ДоставкаНаСклад						= ДоставкаНаСклад;
	МенеджерЗаписи.ДатаОжидаемогоОкончанияПодрядчиком	= ДатаОжидаемогоОкончанияПодрядчиком;
	МенеджерЗаписи.Подрядчик							= Исполнитель;
	МенеджерЗаписи.Комплект								= ОбъектТЗ;
	МенеджерЗаписи.РегистраторДвижения					= Ссылка;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешнееПроизводствоСрезПоследних.ТипВнешнегоПроизводства КАК ТипВнешнегоПроизводства
		|ИЗ
		|	РегистрСведений.ВнешнееПроизводство.СрезПоследних(
		|			,
		|			Комплект = &Комплект
		|				И РегистраторДвижения = &Ссылка) КАК ВнешнееПроизводствоСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", 	ОбъектТЗ);
	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();

	ТипВнешнегоПроизводства = Перечисления.ТипыВнешнегоПроизводства.ПустаяСсылка();
	
	Пока Выборка.Следующий() Цикл
		ТипВнешнегоПроизводства = Выборка.ТипВнешнегоПроизводства;
	КонецЦикла;
	
	ТД = ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.ВнешнееПроизводство.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РегистраторДвижения.Установить(Ссылка);
	НаборЗаписей.Отбор.Комплект.Установить(ОбъектТЗ);
	НаборЗаписей.Отбор.Период.Установить(ТД);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.Период								= ТД;
	НоваяЗапись.Комплект 							= ОбъектТЗ;
	НоваяЗапись.РегистраторДвижения 				= Ссылка;
	НоваяЗапись.ТипЗадачи 							= ТипЗадачи;
	НоваяЗапись.ТипВнешнегоПроизводства				= ТипВнешнегоПроизводства;
	НоваяЗапись.ДатаОжидаемогоОкончанияПодрядчиком	= ДатаОжидаемогоОкончанияПодрядчиком;
	НоваяЗапись.ДоставкаНаСклад 					= ДоставкаНаСклад;
	НоваяЗапись.Подрядчик 							= Исполнитель;
	
	НаборЗаписей.Записать();

КонецПроцедуры
